package com.kay.pro

/**
 * --- HW-1 ---
 * Домашнее задание, урок 1, 04.10.21
 * Сделать консольный калькулятор (+, -, *, /)
 * Обрабатывать деление на 0
 * Обрабатывать пустые строки
 * Обрабатывать строки типа "5ккк"
 * Обрабатывать null
 */

/**
 * --- HW-2 ---
 * Домашнее задание, урок 2, 06.10.21
 * Четырехзначное число назовем счастливым,
 * если сумма первых двух ее цифр равна сумме двух последних.
 * Определить, счастливое ли заданное число, вернуть true, если это так.
 */

/**
 * HW-3
 * отсутствует
 */

/**
 * --- HW-4 ---
 * Найти количество цифр в заданном числе n.,
 * например, число 1 содержит 1 цифру,
 * 456 -- 3 цифры, 65536 -- 5 цифр.
 * Использовать операции со строками в этой задаче запрещается.
 *
 * > 444
 * < число 444 содержит 3 цифр(у/ы)
 */

/**
 * --- HW-5 ---
 * Зная имена и номера телефонов, составьте телефонную книгу,
 * в которой имена друзей сопоставлены с их соответствующими
 * телефонными номерами. Затем вам будет предоставлено неизвестное
 * количество имен для запроса в телефонной книге.
 *
 * Телефонная книга должна быть структурой данных HashMap.
 *
 * Формат ввода
 * - Первая строка содержит целое число, обозначающее
 * количество записей в телефонной книге.
 * - Каждая из последующих строк описывает запись в виде значений,
 * разделенных пробелами, в одной строке.
 * Первое значение - это имя друга, а второе - номер телефона,
 * состоящий из цифр.
 * - После строк записей телефонной книги идет неизвестное
 * количество строк с запросами. Каждая строка (запрос)
 * содержит поиск, и вы должны продолжать читать строки,
 * пока не введете специальную команду для выхода "exit".
 *
 * В новой строке для каждого запроса выведите "Not found",
 * если имя не имеет соответствующей записи в телефонной книге;
 * иначе выведите полное имя в формате name = phoneNumber.
 *
 * - Класс Scanner вам в помощь.
 *
 * Пример ввода
 * > 3
 * > oleg 702300300
 * > sasha 500700700
 * > masha 702398907
 * > oleg
 * > anton
 * > masha
 * > exit
 *
 * Пример вывода
 * < oleg = 702300300
 * < Not found
 * < masha = 702398907
 */

/**
 * --- HW-6 ---
 * отсутствует
 */
